/* Added to PROC_KILLED when the killing signal cause a dump */
" (core dumped)" = " (core dumped)";

/* Separator between permanent and discovered servers */
"--- Discovered Servers ---" = "--- Löydetyt palvelimet ---";

/* Used between items concatenated into comma-separated lists. */
", " = ", ";

/* Inspector process list: process name status annotation */
"(stopped)" = "(pysäytetty)";

/* Inspector process list: process name status annotation */
"(zombie)" = "(zombi)";

/* Start of bookmark name; used to find bookmark names in terminal text */
"[" = "[";

/* User-inserted bookmark; the parameter is the bookmark name */
"[%@]" = "[%@]";

/* Appears in window when the user's custom command/shell isn't found. */
"[Command not found: %@]" = "[Komentoa ei löytynyt: %@]";

/* Failure to create a new terminal session. Displayed in terminal content. */
"[Could not create a new process and open a pseudo-tty.]" = "[Uutta prosessia ei voitu luoda eikä näennäispäätettä voitu avata.]";

/* Appears in window when the shell exits cleanly */
"[Process completed]" = "[Prosessi valmis]";

/* Appears in window when the shell exits abnormally */
"[Process exited - exit code %u]" = "[Prosessi lopetti - lopetuskoodi %u]";

/* Appears in window when the shell is murdered */
"[Process was terminated by signal %d%s]" = "[Prosessi päättyi signaaliin %1$d%2$s]";

/* Appears at the end of restored terminal text; the parameter is a date/time string */
"[Restored %@]" = "[Palautettu %@]";

/* Appears at the start of restored terminal text when truncated */
"[Restored contents truncated]" = "[Palautettu sisältö typistetty]";

/* End of bookmark name; used to find bookmark names in terminal text */
"]" = "]";

/* Separator used for dimensions in window title */
"\\U00D7" = "×";

/* denied request from quarantined/sandboxed application to open file */
"\\U201C%@\\U201D can\\U2019t be opened because %@ is not allowed to open documents in Terminal." = "%@ ei ole avattavissa, koska apilla %@ ei ole lupaa avata dokumentteja Päätteessä.";

/* Inspector process list: separator between process name annotations (middle dot between thin spaces) */
"\\U2009\\U00B7\\U2009" = " · ";

/* Ellipses to indicate unread output in terminal */
"\\U2026" = "…";

/* Displayed to indicate that the Option modifier key is NOT currently mapped to the Meta modifier. */
"\\U2325" = "⌥";

/* Tab/Window close sheet; process name with duplicate name count */
"%@ (%d)" = "%@ (%d)";

/* Bookmark menu-item title format string; the first parameter is the line number, the second parameter is the bookmark name */
"%@: %@" = "%@: %@";

/* Thin-space and ellipses suffixed to process name to indicate activity in terminal */
"%@\\U2009\\U2026" = "%@ …";

/* Window settings save panel; string combined with full user name for default save name */
"%@\\U2019s profile" = "Profiili (%@)";

/* Default name for new window groups; includes user name */
"%@\\U2019s window group" = "Käyttäjän %@ ikkunaryhmä";

/* Insert ellipsis into a string truncated in the middle; the variables are the prefix/suffix of the truncated string. */
"%@\\U2026%@" = "%@…%@";

/* Window settings preferences; Keyboard map; format string for Key description column; argument 1 is the modifier, argument 2 is the key */
"%1$@ %2$@" = "%1$@ %2$@";

/* Window settings preferences; Text appearance; format string for font field; argument 1 is the font name, argument 2 is the font size */
"%1$@ %2$@ pt" = "%1$@ %2$@";

/* The 'use Option as Meta' title. The word 'Meta' should probably not be localized. */
"⌥⃣ ➔  àáâ…" = "⌥⃣ ➔  àáâ…";

/* The 'use Option as Meta' title when on. */
"⌥⃣ ➔ M⃣eta" = "⌥⃣ ➔ M⃣eta";

/* The 'use Option as Meta' title. The word 'Meta' should probably not be localized. */
"⌥ Meta" = "⌥ Meta";

/* The 'use Option as Option key (instead of Meta)' title. */
"⌥ Option" = "⌥ optio";

/* Jump/Select to Previous Bookmark function key description. */
"△" = "△";

/* Jump/Select to Next Bookmark function key description. */
"▽" = "▽";

/* Window settings; error title when settings name is already in use */
"A profile named \\U201C%@\\U201D already exists." = "Profiili ”%@” on jo olemassa.";

/* (No Comment) */
"Alter Profiles" = "Muokkaa profiileita";

/* Function key description */
"Background Color" = "Taustaväri";

/* Default settings; name for default Black on White settings */
"Black on White" = "Musta valkoisella";

/* Default settings; name for default Black on Yellow settings */
"Black on Yellow" = "Musta keltaisella";

/* Default settings; name for default Blue on White settings */
"Blue on White" = "Sininen valkoisella";

/* User-inserted bookmark default name; the parameter is a date/time string */
"Bookmarked %@" = "Kirjanmerkki %@";

/* Informative text for invalid Bracketed Paste Mode content alert. */
"Bracketed Paste Mode is enabled in the terminal and the text to send contains the escape sequence that marks the end of pasted text. This is invalid for Bracketed Paste Mode, and could allow subsequent content in the text to perform arbitrary commands." = "Ryhmitelty sijoitustila on käytössä päätteessä ja lähetettävä teksti sisältää merkkiyhdistelmän, joka ilmaisee sijoitettavan tekstin lopun. Tämä ei ole sallittua ryhmitellyssä sijoitustilassa, koska se mahdollistaa merkkiyhdistelmää seuraavan sisällön suorittamisen mielivaltaisena komentona.";

/* Name of built-in default window settings */
"Built-in" = "Sisäinen";

/* No comment provided by engineer. */
"Cancel" = "Kumoa";

/* for Undo Menu suffix for settings changes - "Undo Change Setting" */
"Change Setting" = "Muuta asetuksia";

/* Menu item title */
"Clear to Previous Bookmark" = "Pyyhi edelliseen kirjanmerkkiin";

/* Menu item title */
"Clear to Previous Mark" = "Pyyhi edelliseen merkkiin";

/* Menu item title */
"Clear to Selected Bookmark" = "Pyyhi valittuun kirjanmerkkiin";

/* Menu item title */
"Clear to Selected Mark" = "Pyyhi valittuun merkkiin";

/* Menu item title */
"Clear to Start of Selection" = "Pyyhi valinnan alkuun";

/* No comment provided by engineer. */
"Close" = "Sulje";

/* No comment provided by engineer. */
"Close All" = "Sulje kaikki";

/* Close current split-pane */
"Close split-pane" = "Sulje jaettu paneeli";

/* (No Comment) */
"Close split-view" = "Sulje jaettu näkymä";

/* Tab close-button accessibility label/title. */
"Close tab" = "Sulje välilehti";

/* Tab close-button accessibility role description. */
"close tab button" = "sulje välilehti -painike";

/* Tab close sheet; message description for a single process */
"Closing this tab will terminate the running process %@." = "Välilehden sulkeminen lopettaa suoritettavan prosessin %@.";

/* Tab close sheet; message description for multiple processes */
"Closing this tab will terminate the running processes: %@." = "Välilehden sulkeminen lopettaa suoritettavat prosessit: %@.";

/* Window close sheet; message description for a single process */
"Closing this window will terminate the running process %@." = "Ikkunan sulkeminen lopettaa suoritettavan prosessin %@.";

/* Window close sheet; message description for multiple processes */
"Closing this window will terminate the running processes: %@." = "Ikkunan sulkeminen lopettaa suoritettavat prosessit: %@.";

/* Compose Email Message contextual menu item. */
"Compose" = "Uusi viesti";

/* SSH/Telnet Connection contextual menu item. */
"Connect" = "Yhdistä";

/* Window settings preferences; text shown with profiles which are set as the Copy Attributes profile */
"Copy" = "Kopiointi";

/* Window settings preferences; text shown with profiles which are set as the default */
"Default" = "Oletus";

/* Tab close sheet; message title */
"Do you want to close this tab?" = "Haluatko sulkea tämän välilehden?";

/* Window close sheet; message title */
"Do you want to close this window?" = "Haluatko sulkea tämän ikkunan?";

/* Tab close sheet; message title when there are running processes */
"Do you want to terminate running processes in this tab?" = "Lopetetaanko tässä välilehdessä suoritettavat prosessit?";

/* Window close sheet; message title when there are running processes */
"Do you want to terminate running processes in this window?" = "Lopetetaanko tässä ikkunassa suoritettavat prosessit?";

/* pboard couldn't give a string. */
"Error: couldn't create a new terminal" = "Virhe: uutta päätettä ei voitu luoda";

/* Service */
"File Transfer (ftp)" = "Tiedostonsiirto (ftp)";

/* Find Panel; window title */
"Find" = "Etsi";

/* Default settings; name for default Green on Black settings */
"Green on Black" = "Vihreä mustalla";

/* Shell menu item title; used when inspector is visible */
"Hide Inspector" = "Kätke inspektori";

/* Menu item title */
"Hide Marks" = "Kätke merkit";

/* View Menu item title; used when the tab bar is shown */
"Hide Tab Bar" = "Kätke välilehtipalkki";

/* Inspector process list: process status */
"Idle" = "Vapaa";

/* Application termination dialog; message description */
"If you don\\U2019t review your windows, any running processes will be terminated." = "Jos et tarkista ikkunoita, suoritettavat prosessit lopetetaan.";

/* Accessibility description for Insert Bookmark. */
"insert bookmark" = "lisää kirjanmerkki";

/* Button title for inserting a new bookmark. */
"Insert Bookmark" = "Lisää kirjanmerkki";

/* No comment provided by engineer. */
"It may have been incompletely copied from another machine." = "Se on ehkä kopioitu vain osittain toiselta tietokoneelta.";

/* Look Up contextual menu item. */
"Look Up" = "Katso lisää";

/* Look Up contextual menu item with selected text. */
"Look Up \\U201C%@\\U201D" = "Katso lisää: %@";

/* Look Up contextual menu item with truncated text. */
"Look Up \\U201C%@\\U2026\\U201D" = "Katso lisää: %@…";

/* Displayed to indicate that the Option modifier key is currently mapped to the Meta modifier. Like the word 'Meta' this should probably not be localized. */
"M" = "M";

/* Open man Page function key label. */
"man page" = "man-sivu";

/* strings used for Shortcut man page support */
"Man Pages" = "Man-sivut";

/* Open man Page function key options label. */
"man Title Automatic" = "Automaattinen";

/* Open man Page function key options label. */
"man Title Fixed Width" = "Kiinteä leveys";

/* Open man Page function key options label. */
"man Title None" = "Ei mitään";

/* Window settings import; alert title shown when multiple files are corrupt */
"Multiple files could not be imported." = "Useita tiedostoja ei voitu tuoda.";

/* Default name for new window settings */
"New profile" = "Uusi profiili";

/* Accessibility description for New Remote Connection. */
"new remote connection" = "uusi etäyhteys";

/* Function key description */
"New Remote Connection" = "Uusi etäyhteys";

/* Button title for making a new tab. */
"New Tab" = "Uusi välilehti";

/* New Tab and contextual menu item title format; the variable is the profile name */
"New Tab with Profile - %@" = "Uusi välilehti profiililla - %@";

/* New Tab menu item title format; the variable is the profile name */
"New Tab with Same Command" = "Uusi välilehti samalla komennolla";

/* New Window menu item title format; the variable is the profile name */
"New Window with Profile - %@" = "Uusi ikkuna profiililla - %@";

/* New Window menu item title format; the variable is the profile name */
"New Window with Same Command" = "Uusi ikkuna samalla komennolla";

/* Accessibility description for Jump/Select to Next Bookmark. */
"next bookmark" = "seuraava kirjanmerkki";

/* Accessibility description for Jump/Select to Next Mark. */
"next mark" = "seuraava merkki";

/* Inspector process list: boolean NO */
"No" = "Ei";

/* Bookmarks menu item title for when there are no bookmarks */
"No Bookmarks" = "Ei kirjanmerkkejä";

/* No options for this service */
"No options" = "Ei valintoja";

/* Title of menu item used in Open Window Group submenu when no groups are available */
"No Window Groups" = "Ei ikkunaryhmiä";

/* Application prefs; string superimposed on table of window groups when none are available */
"No Window Groups Saved" = "Yhtään ikkunaryhmää ei ole tallennettu";

/* Generic save panel; name of object type used in save panel if not otherwise specified */
"object" = "objekti";

/* No comment provided by engineer. */
"OK" = "OK";

/* Open Link contextual menu item. */
"Open Link" = "Avaa linkki";

/* Accessibility description for Open man Page for Selection. */
"open man page" = "avaa man-sivu";

/* Open man Page contextual menu item. */
"Open man Page" = "Avaa man-sivu";

/* Help menu item; the variable is the search term. */
"Open man Page for \\U201C%@\\U201D" = "Avaa kohteen ”%@” man-sivu";

/* Function key description */
"Open man Page for Selection" = "Avaa valinnan man-sivu";

/* Displayed to indicate that the Option modifier key is NOT currently mapped to the Meta modifier. */
"Option" = "Optio";

/* Displayed to indicate that the Option modifier key is currently mapped to the Meta modifier. The word 'Meta' should probably not be localized. */
"Option is Meta" = "Optio on meta";

/* (No Comment) */
"Paste" = "Sijoita";

/* Message text for control-character content alert. */
"Paste control characters?" = "Sijoitetaanko ohjausmerkit?";

/* (No Comment) */
"Paste without Control Characters" = "Sijoita ilman ohjausmerkkejä";

/* Accessibility description for Jump/Select to Previous Bookmark. */
"previous bookmark" = "edellinen kirjanmerkki";

/* Accessibility description for Jump/Select to Previous Mark. */
"previous mark" = "edellinen merkki";

/* Function key description */
"Previous/Next Bookmark" = "Edellinen/seuraava kirjanmerkki";

/* Function key description */
"Previous/Next Mark" = "Edellinen/seuraava merkki";

/* Function key description */
"Previous/Next Mark — Insert Bookmark" = "Edellinen/seuraava merkki — Lisää kirjanmerkki";

/* Default process name */
"Process name" = "Prosessin nimi";

/* Window settings save panel; name of object used in replacement panels */
"profile" = "profiili";

/* (No Comment) */
"QuarantineAllow" = "Salli";

/* (No Comment) */
"QuarantineDeny" = "Älä salli";

/* (No Comment) */
"QuarantineMessage" = "Tämä paljastaa käyttäjätunnuksesi ja verkko-osoitteesi toiselle tietokoneelle. Vältät varoitukset tulevaisuudessa lisäämällä sen tunnettujen palvelimien ssh-luetteloon.";

/* (No Comment) */
"QuarantineMessageError" = "\n\nVirhe etsittäessä tunnettuja palvelimia (suorita ”%@”, jos haluat lisätietoja).";

/* (No Comment) */
"QuarantineTitle2" = " Sallitaanko tämä?";

/* strings used for quarantine alerts */
"QuarantineTitleSSH" = "Pääte avaa ssh-yhteyden kohteeseen %@ apille %@.";

/* (No Comment) */
"QuarantineTitleTelnet" = "Pääte avaa telnet-yhteyden kohteeseen %@ apille %@.";

/* No comment provided by engineer. */
"Quit" = "Lopeta";

/* Service */
"Remote Login (telnet)" = "Etäkirjautuminen (telnet)";

/* Window settings preferences; path control pop-up menu item for removing the background image */
"Remove" = "Poista";

/* Generic save panel; title of button used to replace existing object */
"Replace" = "Korvaa";

/* Generic save panel; information text used for alert when replacing existing countable object. */
"Replacing the %@ will override its contents." = "Sisältö korvautuu, jos %@ korvataan.";

/* Generic save panel; information text used for alert when replacing existing uncountable object. */
"Replacing the %@ will override their contents." = "Kohteiden %@ korvaaminen korvaa niiden sisällön.";

/* Application termination dialog; review windows button title */
"Review Windows\\U2026" = "Tarkista ikkunat…";

/* Inspector process list: process status */
"Runnable" = "Suoritettava";

/* Window group save panel; panel title */
"Save Window Group" = "Tallenna ikkunaryhmä";

/* Help menu item; the variable is the search term. */
"Search man Page Index for \\U201C%@\\U201D" = "Etsi kohdetta ”%@” man-sivuhakemistosta";

/* Open man Page function key options label. */
"Search Term Display:" = "Hakutermin näyttö:";

/* Web search contextual menu item when the search provider is unknown. */
"Search the Web" = "Etsi verkosta";

/* Web search (e.g., Google) contextual menu item. */
"Search with %@" = "%@-haku";

/* Service */
"Secure File Transfer (sftp)" = "Suojattu tiedostonsiirto (sftp)";

/* No comment provided by engineer. */
"Secure Shell (ssh)" = "Suoj. etäkirjautuminen (ssh)";

/* Connect to service option */
"SFTP (Automatic)" = "SFTP (automaattinen)";

/* No comment provided by engineer. */
"SFTP Protocol 1" = "SFTP-protokolla 1";

/* Shell menu item title; used when inspector is not visible */
"Show Inspector" = "Näytä inspektori";

/* Menu item title */
"Show Marks" = "Näytä merkit";

/* View Menu item title; used when the tab bar is hidden */
"Show Tab Bar" = "Näytä välilehtipalkki";

/* Inspector process list: process status */
"Sleeping" = "Siirrytään nukkumaan";

/* Split current pane */
"Split pane" = "Jaa paneeli";

/* strings used for split view controls */
"Split view" = "Jaettu näkymä";

/* No comment provided by engineer. */
"SSH (Automatic)" = "SSH (automaattinen)";

/* Connect to service option */
"SSH Protocol 1" = "SSH-protokolla 1";

/* Connect to service option */
"SSH Protocol 2" = "SSH-protokolla 2";

/* Window settings preferences; text shown with profiles which are set as the startup profile */
"Startup" = "Aloitus";

/* Inspector process list: process status */
"Stopped" = "Pysäytetty";

/* default title */
"Terminal" = "Pääte";

/* Default name for Save Text As... menu */
"Terminal Saved Output.txt" = "Päätteen tallennettu tuloste.txt";

/* Terminal title component; enables adding markup around each of the title components, before they are concatenated with em-dashes between them */
"terminal title component" = "%@";

/* No comment provided by engineer. */
"Terminate" = "Lopeta";

/* Application termination dialog; terminate processes button title */
"Terminate Processes" = "Lopeta prosessit";

/* Generic save panel; title used for alert when replacing existing uncountable object. */
"The %1$@ %2$@ already exist. Do you want to replace them?" = "%1$@ %2$@ ovat jo olemassa. Haluatko korvata ne?";

/* Generic save panel; title used for alert when replacing existing countable object. */
"The %1$@ %2$@ already exists. Do you want to replace it?" = "%1$@ %2$@ on jo olemassa. Haluatko korvata sen?";

/* No comment provided by engineer. */
"The administrator has set your shell to an illegal value." = "Ylläpitäjä on asettanut komentotulkiksi virheellisen vaihtoehdon.";

/* No comment provided by engineer. */
"The file \\U201C%@\\U201D could not be executed because you do not have appropriate access privileges." = "Tiedostoa ”%@” ei voitu suorittaa, koska tarvittavat käyttöoikeudet puuttuvat.";

/* Window settings import; alert title shown when a single file is corrupt; %@ is filename */
"The file \\U201C%@\\U201D could not be imported." = "Tiedostoa ”%@” ei voitu tuoda.";

/* No comment provided by engineer. */
"The file \\U201C%@\\U201D could not be opened because it is corrupt." = "Tiedostoa ”%@” ei voitu avata, koska se on vioittunut.";

/* Window settings import; alert description shown when a single file is corrupt */
"The file is corrupt. You may be able to obtain a fresh copy of the file from its author." = "Tiedosto on vahingoittunut. Voit saada toimivan tiedoston sen tekijältä.";

/* Window settings import; alert description shown when a multiple files are corrupt; %@ is comma-separated list of filenames */
"The following files are corrupt: %@. You may be able to obtain a fresh copy of the files from their author." = "Seuraavat tiedostot ovat vahingoittuneet: %@. Voit saada toimivat tiedostot niiden tekijöiltä.";

/* Window settings; error title when settings name is empty */
"The name is too short." = "Nimi on liian lyhyt.";

/* Informative text for control-character content alert. */
"The text contains control characters, which could allow the pasted content to perform arbitrary commands.\n\nTo confirm and Paste, you can use \\U21E7\\U2318\\U23CE." = "Teksti sisältää ohjausmerkkejä, mikä voi mahdollistaa mielivaltaisten komentojen suorittamisen.\n\nVoit vahvistaa ja sijoittaa painamalla ⇧⌘⏎.";

/* No comment provided by engineer. */
"To view or change access privileges, select the file in the Finder and choose File > Get Info." = "Jos haluat tarkastella tai muuttaa käyttöoikeuksia, valitse tiedosto Finderissa ja valitse Arkisto > Näytä tietoja.";

/* Window settings; error description when settings name is already in use or is reserved */
"Try entering a different name." = "Syötä toinen nimi.";

/* Window settings; error description when settings name is empty */
"Try entering a name with more characters." = "Syötä nimi, jossa on enemmän merkkejä.";

/* Accessibility description for Use Option as Meta Key. */
"use option as meta key" = "käytä optionäppäintä metanäppäimenä";

/* Function key description */
"Use Option as Meta Key" = "Käytä optionäppäintä metanäppäimenä";

/* Function key description */
"Use Option Instead of Meta" = "Käytä optiota metan sijaan";

/* Function keys description */
"VT100 (PF1-PF4)" = "VT100 (PF1–PF4)";

/* Function keys description */
"VT220 (PF1-PF4 + F5-F20)" = "VT220 (PF1–PF4 + F5–F20)";

/* Function keys description */
"VT220 Compact (F1-F20)" = "VT220 – kompakti (F1–F20)";

/* Function keys description */
"VT220 Extras (F13-F20)" = "VT220 – ekstrat (F13–F20)";

/* Function keys description */
"VT420 All Enabled (PF1-PF4 + F1-F20)" = "VT420 – kaikki käytössä (PF1–PF4 + F1–F20)";

/* No comment provided by engineer. */
"w" = "w";

/* Default settings; name for default White on Black settings */
"White on Black" = "Valkoinen mustalla";

/* Default settings; name for default White on Blue settings */
"White on Blue" = "Valkoinen sinisellä";

/* Window group save panel; name of object used in replacement panels */
"window group" = "ikkunaryhmä";

/* Inspector process list: boolean YES */
"Yes" = "Kyllä";

/* No comment provided by engineer. */
"You are not authorized to run this application." = "Sinulla ei ole oikeuksia suorittaa tätä appia.";

/* Message text for invalid Bracketed Paste Mode content alert. */
"You cannot send the text to the terminal, because it contains invalid content for Bracketed Paste Mode." = "Tekstiä ei voida lähettää päätteelle, koska siinä on sisältöä, joka ei ole sallittua ryhmitellyssä sijoitustilassa.";

/* Application termination dialog; message title */
"You have %d windows with running processes. Do you want to review these windows before quitting?" = "%d ikkunassa on suoritettavia prosesseja. Haluatko tarkistaa ikkunat ennen lopettamista?";

/* Inspector process list: process status */
"Zombie" = "Zombi";

